{"class_name": "Model", "config": {"name": "vae", "layers": [{"name": "encoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 65], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_input"}, "inbound_nodes": []}, {"name": "encoder", "class_name": "Model", "config": {"name": "encoder", "layers": [{"name": "encoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 65], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_input"}, "inbound_nodes": []}, {"name": "dense", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"name": "z_mean", "class_name": "Dense", "config": {"name": "z_mean", "trainable": true, "dtype": "float32", "units": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"name": "z_log_var", "class_name": "Dense", "config": {"name": "z_log_var", "trainable": true, "dtype": "float32", "units": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"name": "z", "class_name": "Lambda", "config": {"name": "z", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABgAAAAUAAABDAAAAc0oAAAB8AC8CfQF9AnQAoAF8AaEBZAEZAH0DdACgAnwBoQFk\nAhkAfQR0AGoDfAN8BGYCZAONAX0FfAF0AKAEZAR8AhQAoQF8BRQAFwBTACkF+sxSZXBhcmFtZXRl\ncml6YXRpb24gdHJpY2sgYnkgc2FtcGxpbmcgZnJvbSBhbiBpc290cm9waWMgdW5pdCBHYXVzc2lh\nbi4KICAgICMgQXJndW1lbnRzCiAgICAgICAgYXJncyAodGVuc29yKTogbWVhbiBhbmQgbG9nIG9m\nIHZhcmlhbmNlIG9mIFEoenxYKQogICAgIyBSZXR1cm5zCiAgICAgICAgeiAodGVuc29yKTogc2Ft\ncGxlZCBsYXRlbnQgdmVjdG9yCiAgICDpAAAAAOkBAAAAKQHaBXNoYXBlZwAAAAAAAOA/KQXaAUty\nBAAAANoJaW50X3NoYXBl2g1yYW5kb21fbm9ybWFs2gNleHApBtoEYXJnc9oGel9tZWFu2gl6X2xv\nZ192YXLaBWJhdGNo2gNkaW3aB2Vwc2lsb26pAHIPAAAA+jRDOi9Vc2Vycy9zb21lbi9EZXNrdG9w\nL0NhcHN0b25lL2NicmFpbi9tb2RlbHNfbmV3LnB52ghzYW1wbGluZzwAAABzCgAAAAAHCAEOAQ4C\nEAE=\n", null, null], "function_type": "lambda", "module": "cbrain.models_new", "output_shape": [12], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["z_mean", 0, 0, {}], ["z_log_var", 0, 0, {}]]]}], "input_layers": [["encoder_input", 0, 0]], "output_layers": [["z_mean", 0, 0], ["z_log_var", 0, 0], ["z", 0, 0]]}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"name": "decoder", "class_name": "Model", "config": {"name": "decoder", "layers": [{"name": "z_sampling", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "z_sampling"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["z_sampling", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 65, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}], "input_layers": [["z_sampling", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "inbound_nodes": [[["encoder", 1, 2, {}]]]}], "input_layers": [["encoder_input", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}